# Importing Libraries and Dataframe

In [1]:
    #Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Importing data from 'customer data set'
path = r'/Users/marialuciaguarita/Python Careerfoundry Project 1'
customers = pd.read_csv(os.path.join(path,'Data','Original Data','customers.csv'), index_col = False)

In [3]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
customers.shape

(206209, 10)

# Cleaning Data

In [5]:
#Checking for null values
customers.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [6]:
#Dropping unecessary columns
customers_w = customers.drop(columns = ['First Name','Surnam'])

In [7]:
#Changing columns name 
customers_w.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [8]:
customers_w.rename(columns = {'Age' : 'age'}, inplace = True)

In [9]:
customers_w.rename(columns = {'STATE' : 'state'}, inplace = True)

In [10]:
customers_w.head()

,user_id,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
#Checking data types
customers_w.dtypes

user_id          int64
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [12]:
customers_w['user_id'] = customers_w['user_id'].astype('str')

In [13]:
customers_w.dtypes

user_id         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [14]:
#Searching for mixed-type data
for col in customers_w.columns.tolist():
  weird = (customers_w[[col]].applymap(type) != customers_w[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers_w[weird]) > 0:print (col)

No mixed-type data found

In [15]:
#Checking for missing values
customers_w.isnull().sum()

user_id         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

No missing values

In [16]:
#Finding Duplicated Values
customers_clean = customers_w[customers_w.duplicated()]

In [17]:
customers_clean

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

No duplicated data found

In [18]:
#Importing data from 'ords_prods_merged'
path = r'/Users/marialuciaguarita/Python Careerfoundry Project 1'
ords_prods_merge = pd.read_pickle(os.path.join(path,'Data','Prepared Data','orders_products_products_combined4.pkl'))

In [19]:
#Combining Data from customers to ords_prods_merge
ords_prods_cust_merge = customers_w.merge(ords_prods_merge, on = 'user_id', indicator = 'merge_3')

In [20]:
ords_prods_cust_merge.columns

Index(['user_id', 'gender', 'state', 'age', 'date_joined', 'n_dependants',
       'fam_status', 'income', 'product_id', 'product_name', 'aisle_id',
       'department_id', 'prices', 'order_id', 'eval_set', 'order_number',
       'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order',
       'add_to_cart_order', 'reordered', 'price_range_loc', 'busiest_day',
       'frequency_of_days_loc', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'max_spend', 'spending_flag', 'frequency_range',
       'frequency_flag', 'merge_3'],
      dtype='object')

In [21]:
# Exporting as Pickle
ords_prods_cust_merge.to_pickle(os.path.join(path, 'Data','Prepared Data', 'orders_products_customers.pkl'))